; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared3 - mode
	thermograph0 - mode
	thermograph1 - mode
	image4 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Star5 - direction
	Star8 - direction
	Star3 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 image4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Star10 infrared3)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 infrared3)
))

)

; plan
1. (turn_to satellite1 planet11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet11)
   goals met: 1 of 6
2. (turn_to satellite0 groundstation1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
4. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 6
5. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
6. (take_image satellite0 phenomenon13 instrument1 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 2 of 6
7. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 6
8. (take_image satellite0 phenomenon12 instrument1 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 3 of 6
9. (turn_to satellite0 phenomenon14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 6
10. (take_image satellite0 phenomenon14 instrument1 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 4 of 6
11. (turn_to satellite0 planet11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet11)
   goals met: 4 of 6
12. (take_image satellite0 planet11 instrument1 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 6
13. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 5 of 6
14. (take_image satellite0 star10 instrument1 infrared3)
   added: (have_image star10 infrared3)
   goals met: 6 of 6
